Revit 2027 API
GenericForm.Visible Property
The visibility of the GenericForm.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Visible { get; }
Public ReadOnly Property Visible As Boolean
	Get
public:
property bool Visible {
	bool get ();
}
member Visible : bool with get
Property Value
Boolean
True if the form is visible, false if it is hidden.
See Also
Reference
GenericForm Class
Autodesk.Revit.DB Namespace